# Terminal & Shell
brew "zsh"
brew "tmux"
brew "et"
brew "starship"
cask "ghostty" if OS.mac?
cask "font-meslo-lg-nerd-font" if OS.mac?

# System Utilities
brew "btop"

# Editor
brew "neovim"

# Development
brew "git"
brew "mise"

# Search & Navigation
brew "ripgrep"
brew "fd"
brew "fzf"
brew "tree"
brew "zoxide"

# File Viewing
brew "bat"
brew "glow"
brew "eza"

# Formatters & Linters
brew "stylua"
